[
  {
    "word": "paradoxical",
    "definition": "seemingly absurd or self-contradictory",
    "sentence": "The paradoxical nature of his statement left everyone confused."
  },
  {
    "word": "nostalgia",
    "definition": "a sentimental longing or wistful affection for the past",
    "sentence": "Listening to that song filled her with nostalgia for her childhood."
  },
  {
    "word": "idiosyncratic",
    "definition": "peculiar or individual; characteristic, habit, or mannerism",
    "sentence": "Her idiosyncratic style set her apart from other artists."
  },
  {
    "word": "conscientious",
    "definition": "wishing to do what is right, especially to do one's work or duty well and thoroughly",
    "sentence": "She is a conscientious student who always submits her assignments on time."
  },
  {
    "word": "voracious",
    "definition": "having a very eager approach to an activity",
    "sentence": "He was a voracious reader, devouring books in every genre."
  },
  {
    "word": "bellicose",
    "definition": "demonstrating aggression and willingness to fight",
    "sentence": "The bellicose remarks from the politician raised tensions in the room."
  },
  {
    "word": "epistemology",
    "definition": "the theory of knowledge, especially with regard to its methods, validity, and scope",
    "sentence": "Epistemology is a fundamental aspect of philosophy."
  },
  {
    "word": "sophistry",
    "definition": "the use of fallacious arguments, especially with the intention of deceiving",
    "sentence": "His arguments were nothing more than sophistry designed to mislead the jury."
  },
  {
    "word": "schadenfreude",
    "definition": "pleasure derived by someone from another person's misfortune",
    "sentence": "He felt a sense of schadenfreude watching his rival fail."
  },
  {
    "word": "floccinaucinihilipilification",
    "definition": "the action or habit of estimating something as worthless",
    "sentence": "His floccinaucinihilipilification of the project led to its eventual failure."
  }
]