[
  {
    "word": "metamorphosis",
    "definition": "a change of the form or nature of a thing or person into a completely different one",
    "sentence": "The caterpillar underwent a metamorphosis, emerging as a beautiful butterfly."
  },
  {
    "word": "idiosyncrasy",
    "definition": "a characteristic, habit, or mannerism that is peculiar to an individual",
    "sentence": "His idiosyncrasy of wearing mismatched socks became a trademark of his style."
  },
  {
    "word": "paradigm",
    "definition": "a typical example or pattern of something; a model",
    "sentence": "The new research provides a paradigm shift in our understanding of the disease."
  },
  {
    "word": "nostalgia",
    "definition": "a sentimental longing for the past",
    "sentence": "Listening to that song filled her with nostalgia for her childhood."
  },
  {
    "word": "antithesis",
    "definition": "a contrast or opposition between two things",
    "sentence": "Her carefree attitude was the antithesis of his serious demeanor."
  },
  {
    "word": "altruism",
    "definition": "the belief in or practice of disinterested and selfless concern for the well-being of others",
    "sentence": "His altruism was evident in all the volunteer work he did."
  },
  {
    "word": "recapitulate",
    "definition": "to summarize and state again the main points",
    "sentence": "The professor recapitulated the lecture in the final minutes of the class."
  },
  {
    "word": "antipathy",
    "definition": "a deep-seated feeling of aversion",
    "sentence": "He felt a strong antipathy toward the policies of the administration."
  },
  {
    "word": "anachronism",
    "definition": "a thing belonging or appropriate to a period other than that in which it exists",
    "sentence": "The use of a smartphone in a historical film was a glaring anachronism."
  },
  {
    "word": "ossify",
    "definition": "to turn into bone or bony tissue; to become rigid or fixed in pattern",
    "sentence": "As opinions ossify, it becomes difficult to implement change."
  }
]