[
  {
    "word": "beautiful",
    "definition": "pleasing the senses or mind aesthetically",
    "sentence": "The sunset over the mountains was absolutely beautiful."
  },
  {
    "word": "perseverance",
    "definition": "persistence in doing something despite difficulty or delay in achieving success",
    "sentence": "Her perseverance through challenges led to her ultimate success."
  },
  {
    "word": "quintessential",
    "definition": "representing the most perfect or typical example of a quality or class",
    "sentence": "He is the quintessential artist, always pushing the boundaries of creativity."
  },
  {
    "word": "juxtaposition",
    "definition": "the fact of two things being seen or placed close together with contrasting effect",
    "sentence": "The juxtaposition of light and dark in her painting created a powerful effect."
  },
  {
    "word": "ineffable",
    "definition": "too great or extreme to be expressed in words",
    "sentence": "The beauty of the landscape was ineffable, leaving us speechless."
  },
  {
    "word": "defenestration",
    "definition": "the act of throwing someone out of a window",
    "sentence": "The historical event of the defenestration of Prague marked a turning point in the conflict."
  },
  {
    "word": "languid",
    "definition": "Weak or faint from illness or fatigue; displaying a lack of energy or vitality.",
    "sentence": "After a long day in the sun, she felt languid and ready for a nap."
  },
  {
    "word": "ebullient",
    "definition": "Cheerful and full of energy; overflowing with enthusiasm.",
    "sentence": "His ebullient personality made him the life of every party."
  },
  {
    "word": "nefarious",
    "definition": "Wicked or criminal; villainous in nature.",
    "sentence": "The detective uncovered a nefarious plot to embezzle funds."
  },
  {
    "word": "quixotic",
    "definition": "Exceedingly idealistic; unrealistic and impractical.",
    "sentence": "His quixotic dreams of becoming a famous artist often distracted him from his studies."
  }
]