[
  {
    "word": "extraordinary",
    "definition": "very unusual or remarkable",
    "sentence": "His performance was extraordinary and left the audience in awe."
  },
  {
    "word": "diligent",
    "definition": "having or showing care and conscientiousness in one's work or duties",
    "sentence": "She was diligent in her studies, always striving for the best results."
  },
  {
    "word": "inevitable",
    "definition": "certain to happen; unavoidable",
    "sentence": "The changes in technology are inevitable and must be embraced."
  },
  {
    "word": "perseverance",
    "definition": "persistence in doing something despite difficulty or delay in achieving success",
    "sentence": "Her perseverance paid off when she finally completed her marathon."
  },
  {
    "word": "ambiguous",
    "definition": "open to more than one interpretation; not having one obvious meaning",
    "sentence": "The instructions were ambiguous, leading to confusion among the team."
  },
  {
    "word": "sonder",
    "definition": "the realization that each random passerby is living a life as vivid and complex as your own",
    "sentence": "Walking through the city, he experienced a moment of sonder as he watched the crowd."
  },
  {
    "word": "limerence",
    "definition": "the state of being infatuated or obsessed with another person, typically involuntarily and with an intense emotional longing",
    "sentence": "Her limerence for him was so strong that she found herself daydreaming about him constantly."
  },
  {
    "word": "mellifluous",
    "definition": "a sound that is pleasingly smooth and musical to hear",
    "sentence": "Her mellifluous voice captivated everyone in the room."
  },
  {
    "word": "petrichor",
    "definition": "the pleasant, earthy smell after rain",
    "sentence": "After the storm, the petrichor filled the air, refreshing the atmosphere."
  },
  {
    "word": "ebullient",
    "definition": "cheerful and full of energy",
    "sentence": "Her ebullient personality lit up the entire room."
  }
]