[
  {
    "word": "ennui",
    "definition": "a feeling of listlessness and dissatisfaction arising from a lack of occupation or excitement",
    "sentence": "He felt an overwhelming ennui during the long, uneventful summer."
  },
  {
    "word": "esoteric",
    "definition": "intended for or likely to be understood by only a small number of people with a specialized knowledge",
    "sentence": "The professor's lecture on quantum mechanics was filled with esoteric concepts."
  },
  {
    "word": "metamorphosis",
    "definition": "a change of the form or nature of a thing or person into a completely different one",
    "sentence": "The caterpillar's metamorphosis into a butterfly is a fascinating process."
  },
  {
    "word": "cacophonic",
    "definition": "characterized by a harsh, discordant mixture of sounds",
    "sentence": "The cacophonic sounds of the construction site made it hard to concentrate."
  },
  {
    "word": "disenfranchised",
    "definition": "deprived of power; deprived of the right to vote",
    "sentence": "Many disenfranchised citizens marched for their rights."
  },
  {
    "word": "inequitable",
    "definition": "unfair, unjust",
    "sentence": "The inequitable distribution of resources led to widespread protests."
  },
  {
    "word": "kaleidoscope",
    "definition": "a constantly changing pattern or sequence of elements",
    "sentence": "Her emotions were like a kaleidoscope, shifting rapidly with every thought."
  },
  {
    "word": "vociferous",
    "definition": "expressing feelings or opinions in a very loud or forceful way",
    "sentence": "The vociferous crowd made it clear they were unhappy with the decision."
  },
  {
    "word": "yoke",
    "definition": "to join together, especially in a way that restricts freedom",
    "sentence": "They were yoked together in a partnership that they could not escape."
  },
  {
    "word": "apotheosis",
    "definition": "the highest point in the development of something; a culmination or climax",
    "sentence": "His performance in the play was the apotheosis of his acting career, earning him critical acclaim."
  }
]